{
  "name": "Ninja",
  "rarity": "Legendary",
  "affinity": "Magic",
  "faction": "Shadowkin",
  "role": "Attack",
  "owned": 1,
  "base_stats": {
    "HP": 16845,
    "ATK": 1509,
    "DEF": 947,
    "SPD": 100,
    "C.RATE": 15,
    "C.DMG": 63,
    "RES": 30,
    "ACC": 10
  },
  "aura": "None",
  "meta_ratings": {
    "clan_boss": "10/10",
    "dungeons": "10/10",
    "doom_tower": "9/10",
    "arena": "7/10",
    "faction_wars": "10/10"
  },
  "skills": [
    {
      "name": "Shatterbolt",
      "type": "A1",
      "description": "Attacks 1 enemy. Has a 45% chance of placing a 60% [Decrease DEF] debuff for 2 turns. Also fills this Champion's Turn Meter by 15% when used against Bosses.",
      "effects": [
        {
          "type": "damage",
          "stat": "ATK",
          "value": 3.7,
          "per_hit": false,
          "target": "single_enemy",
          "duration": 0,
          "notes": "Single hit, 3.7 ATK multiplier. 45%→60% chance (booked) to place 60% Decrease DEF for 2 turns."
        },
        {
          "type": "debuff",
          "stat": "DECREASE_DEF",
          "value": 60,
          "per_hit": false,
          "target": "single_enemy",
          "duration": 2,
          "notes": "45% base chance (60% when booked) to place 60% Decrease DEF for 2 turns. CRITICAL debuff for team damage."
        },
        {
          "type": "turn_meter_fill",
          "stat": "TM",
          "value": 15,
          "per_hit": false,
          "target": "self",
          "duration": 0,
          "notes": "Fills Ninja's TM by 15% when used against BOSSES ONLY. Does NOT trigger vs waves. Enables faster cycling for passive stacking."
        }
      ],
      "cooldown_booked": null,
      "mechanics_tags": ["Single Hit", "Decrease DEF", "Turn Meter Fill (Boss)"],
      "book_value": "+10% damage, +15% debuff chance (45%→60%)",
      "notes": "Turn Meter fill ONLY triggers against bosses. Passive 'Escalation' requires all 3 skills (A1, A2, A3) to land on same target in one ROUND for stacking (not per turn - one round = all champions take turns once)."
    },
    {
      "name": "Hailburn",
      "type": "A2",
      "description": "Attacks 3 times at random. Each hit has a 75% chance of placing [HP Burn] debuff for 3 turns. Also places a [Perfect Veil] buff on this Champion for 2 turns. When used against Bosses, will instantly activate any [HP Burn] debuffs, including [HP Burn] debuffs placed by this Skill.",
      "effects": [
        {
          "type": "damage",
          "stat": "ATK",
          "value": 2.0,
          "per_hit": true,
          "target": "random_enemies",
          "duration": 0,
          "notes": "Triple random hit, 2.0 ATK multiplier per hit (6.0 total if all hit same target). 75%→100% chance (booked) per hit to place HP Burn for 3 turns."
        },
        {
          "type": "debuff",
          "stat": "HP_BURN",
          "value": 1,
          "per_hit": true,
          "target": "random_enemies",
          "duration": 3,
          "notes": "75% base chance (100% when booked) per hit to place HP Burn for 3 turns. Up to 3 HP Burns if all hit same target (though only 1 active, extras reset duration)."
        },
        {
          "type": "buff",
          "stat": "PERFECT_VEIL",
          "value": 1,
          "per_hit": false,
          "target": "self",
          "duration": 2,
          "notes": "Places Perfect Veil on Ninja for 2 turns. Perfect Veil = CANNOT be targeted by enemies (better than normal Veil which is 50% chance to avoid targeting). Critical for survivability in waves."
        },
        {
          "type": "hp_burn_activation",
          "stat": "HP_BURN",
          "value": 100,
          "per_hit": false,
          "target": "all_enemies_with_hp_burn",
          "duration": 0,
          "notes": "When used against BOSSES, instantly activates ALL HP Burn debuffs on ALL enemies (not just from this skill - ANY HP Burn source). UNIQUE MECHANIC - only Ninja has this. Each HP Burn activation = 2.5% enemy MAX HP damage (ignores DEF). With 3 HP Burns placed by A2 + HP Burn from teammates (e.g., Drexthar, Geomancer, Mortu-Macaab), can instantly deal 10%+ enemy MAX HP damage. CRITICAL for Spider, CB, all boss content."
        }
      ],
      "cooldown_booked": 3,
      "mechanics_tags": ["Triple Hit", "HP Burn (3 turns)", "Perfect Veil", "HP Burn Activation (Boss)", "Random Targeting"],
      "book_value": "+15% damage, +25% debuff chance (75%→100% per hit), -1 CD (4→3 turns)",
      "notes": "SIGNATURE SKILL. Only champion in RAID with HP Burn ACTIVATION. When targeting boss, instantly activates ALL HP Burn debuffs for massive damage (2.5% enemy MAX HP per HP Burn, ignores DEF). Perfect Veil protects Ninja for 2 turns. MUST book to 100% HP Burn chance and 3-turn CD."
    },
    {
      "name": "Cyan Slash",
      "type": "A3",
      "description": "Attacks all enemies. Has a 75% chance of placing a [Freeze] debuff for 1 turn. When targeting a Boss, will only attack the Boss (not all enemies) and will ignore 50% of the target's DEF. Will also decrease the cooldown of the Hailburn skill by 1 turn.",
      "effects": [
        {
          "type": "damage",
          "stat": "ATK",
          "value": 3.0,
          "per_hit": false,
          "target": "aoe_enemies",
          "duration": 0,
          "notes": "AOE attack, 3.0 ATK multiplier. 75%→100% chance (booked) to Freeze all enemies for 1 turn. WAVE CLEAR MODE."
        },
        {
          "type": "debuff",
          "stat": "FREEZE",
          "value": 1,
          "per_hit": false,
          "target": "aoe_enemies",
          "duration": 1,
          "notes": "75% base chance (100% when booked) to Freeze all enemies for 1 turn. Freeze = enemy cannot take turn (strongest CC)."
        },
        {
          "type": "damage",
          "stat": "ATK",
          "value": 3.95,
          "per_hit": false,
          "target": "single_enemy_boss",
          "duration": 0,
          "notes": "VS BOSSES: Single target attack, 3.95 ATK multiplier. IGNORES 50% of boss DEF. BOSS MODE - changes from AOE to single-target."
        },
        {
          "type": "cooldown_reduction",
          "stat": "COOLDOWN",
          "value": 1,
          "per_hit": false,
          "target": "self",
          "duration": 0,
          "notes": "VS BOSSES ONLY: Reduces Hailburn (A2) cooldown by 1 turn. Enables faster A2 cycling for HP Burn spam + activation."
        }
      ],
      "cooldown_booked": 4,
      "mechanics_tags": ["AoE", "Freeze", "Ignore DEF (Boss)", "Hailburn Cooldown Reduction (Boss)", "Dual Mode"],
      "book_value": "+15% damage, +25% debuff chance (75%→100% Freeze), -1 CD (5→4 turns)",
      "notes": "DUAL MODE SKILL. VS WAVES: AOE Freeze (crowd control). VS BOSSES: Single-target high damage (3.95 ATK, ignores 50% DEF) + reduces A2 cooldown by 1 turn (enables A2 spam). MUST book to 100% Freeze chance and 4-turn CD."
    },
    {
      "name": "Escalation",
      "type": "Passive",
      "description": "Increases Ninja's ATK by 10% (up to 100%) and C.DMG% (up to 25%) each time a single enemy is hit by all three of Ninja's Active Skills in a single Round. This effect can occur multiple times against the same enemy. When fighting Bosses, will increase Ninja's ATK by 20% (up to 100%) and C.DMG by 10% (up to 25%) instead.",
      "effects": [
        {
          "type": "self_buff_stacking",
          "stat": "ATK",
          "value": 10,
          "per_hit": false,
          "target": "self",
          "duration": 999,
          "notes": "VS WAVES: +10% ATK per stack (max 10 stacks = +100% ATK total). Stacks when A1, A2, A3 all land on SAME enemy in ONE ROUND."
        },
        {
          "type": "self_buff_stacking",
          "stat": "C.DMG",
          "value": 2.5,
          "per_hit": false,
          "target": "self",
          "duration": 999,
          "notes": "VS WAVES: +2.5% C.DMG per stack (max 10 stacks = +25% C.DMG total). Stacks when A1, A2, A3 all land on SAME enemy in ONE ROUND."
        },
        {
          "type": "self_buff_stacking",
          "stat": "ATK",
          "value": 20,
          "per_hit": false,
          "target": "self",
          "duration": 999,
          "notes": "VS BOSSES: +20% ATK per stack (max 5 stacks = +100% ATK total). Stacks FASTER than waves (20% vs 10%). Stacks when A1, A2, A3 all land on boss in ONE ROUND."
        },
        {
          "type": "self_buff_stacking",
          "stat": "C.DMG",
          "value": 10,
          "per_hit": false,
          "target": "self",
          "duration": 999,
          "notes": "VS BOSSES: +10% C.DMG per stack (max 3 stacks = +25% C.DMG total, math: 10+10+5=25). Stacks FASTER than waves (10% vs 2.5%). Stacks when A1, A2, A3 all land on boss in ONE ROUND."
        }
      ],
      "cooldown_booked": null,
      "mechanics_tags": ["Passive", "Self Buff Stacking", "Boss Scaling", "ATK Buff", "C.DMG Buff"],
      "book_value": "No books required (passive)",
      "notes": "CRITICAL PASSIVE for boss damage scaling. Requires A1, A2, A3 to ALL hit SAME target in ONE ROUND (not turn - round = full rotation of all champions). VS BOSSES: stacks FASTER (20% ATK, 10% C.DMG per stack vs 10% ATK, 2.5% C.DMG for waves). Max stacks: +100% ATK, +25% C.DMG. Typical CB fight: reaches max stacks by turn 5-7 = massive damage scaling. Use A1→A2→A3 rotation on boss for fastest stacking."
    }
  ],
  "mechanics_tags": ["Triple Hit", "Decrease DEF", "AoE", "HP Burn", "HP Burn Activation", "Freeze", "Perfect Veil", "Self Buff Stacking", "Cooldown Reduction", "Ignore DEF", "Passive"],
  "stat_priorities": ["C.RATE (100%)", "C.DMG", "ATK%", "SPD (220+)", "ACC (250+)"],
  "stat_priority_recommendations": {
    "clan_boss": "100% C.RATE (non-negotiable), 220+ SPD (speed tune dependent), 250+ ACC (UNM), C.DMG 200%+, ATK 3,500+ (pre-passive stacking). Passive adds +100% ATK at max stacks = effective 7,000+ ATK. Warmaster procs from A1 (single-hit, 60% chance). Giant Slayer procs from A2 (triple-hit, ~66% total chance = 30% per hit × 3 hits). Recommend Warmaster OR Giant Slayer depending on build focus.",
    "dungeons": "100% C.RATE, 220+ SPD, 250+ ACC, C.DMG 200%+, ATK 3,500+, HP 35,000+ (survivability). Focus on HP Burn uptime and freeze control.",
    "doom_tower": "100% C.RATE, 220+ SPD, 350+ ACC (Hard DT), C.DMG 200%+, ATK 3,500+, HP 50,000+ (survivability for Hard floors), DEF 1,500+ (survivability). Perfect Veil helps survive wave bursts.",
    "arena": "100% C.RATE, 250+ SPD (speed tuning for nuker role), 250+ ACC (Freeze), C.DMG 250%+, ATK 4,000+. Build for nuking - ignore survivability, max damage output.",
    "faction_wars": "100% C.RATE, 220+ SPD, 250+ ACC, C.DMG 200%+, ATK 3,500+, HP 40,000+ (survivability). Shadowkin faction - user progress unknown."
  },
  "recommended_gear": [
    "CLAN BOSS (UNM): Lifesteal + Speed OR Lifesteal + Accuracy sets. 100% C.RATE (CRITICAL), 220+ SPD (speed tune dependent - 171-191 for Budget Unkillable, 220+ for Counterattack), 250+ ACC (UNM debuff landing), C.DMG 200%+, ATK 3,500+ (pre-passive). Typical speed tunes: Budget Unkillable (171-191 SPD), Counterattack (220+ SPD), Myth-Heir (specific speeds). MUST book A2 (100% HP Burn) and A3 (4-turn CD + 100% Freeze). Warmaster OR Giant Slayer (see masteries notes). Typical CB damage: 10-20M (early game), 20-40M (mid-game with good gear), 40-60M+ (end-game with max stacks + good team). HP Burn activation deals 2.5% enemy MAX HP per burn (ignores DEF) - with 3 HP Burns from A2 = instant 7.5% MAX HP damage (~3M on UNM CB).",
    "CLAN BOSS (Relentless build - advanced): Relentless + Speed/Accuracy sets for extra turns (enables A2 spam for HP Burn activation). Requires VERY high ACC (250+), 100% C.RATE, 220+ SPD, C.DMG 200%+. Relentless 18% chance per turn for extra turn = can use A2 twice in one rotation for double HP Burn activation. High-risk, high-reward build for max CB damage (50M+ potential). Requires excellent gear and speed tuning to avoid breaking rotation.",
    "DUNGEONS (Dragon 25, Spider 25, Ice Golem 25, Fire Knight 25): Lifesteal + Speed OR Savage + Cruel sets (nuker build). Dragon/Spider: HP Burn activation (A2) deals massive damage to boss. Spider: Pair with AOE HP Burn champions (Drexthar, Geomancer, Mordecai, Ultimate Galek) for maximum A2 value. Fire Knight: A1 Decrease DEF + A3 single-target damage (ignores 50% DEF). Ice Golem: A3 Freeze for wave control. Build: 100% C.RATE, 220+ SPD, 250+ ACC, C.DMG 200%+, ATK 3,500+. Typical clear times: Dragon 1:30-2:30, Spider 1:00-2:00 (with HP Burn team), FK 2:00-3:00, IG 2:00-3:00.",
    "DOOM TOWER (All Bosses - Celestial Griffin, Dark Fae, Eternal Dragon, Scarab, Bommal, Nether Spider, etc.): Lifesteal + Perception/Accuracy sets for survivability + ACC. 100% C.RATE, 220+ SPD, 350+ ACC (Hard DT), C.DMG 200%+, ATK 3,500+, HP 50,000+ (Hard survivability). HP Burn activation (A2) is CRITICAL for all bosses. Celestial Griffin: Top-tier (HP Burn activation spam). Bommal Dreadhorn: A3 Freeze prevents Dreadbombs from counterattacking (reduces damage by 50%). Scarab King: HP Burn bypasses shield. Nether Spider: A3 Freeze prevents spiderling counterattacks. Dark Fae: HP Burn activation before she reaches 5 dark energy.",
    "ARENA (Nuker build): Savage + Cruel sets for maximum damage (ignore DEF + extra C.DMG). 100% C.RATE, 250+ SPD (speed tune for nuker role after booster), 250+ ACC (A3 Freeze), C.DMG 250%+, ATK 4,000+. Typical rotation: Speed booster (High Khatun, Arbiter) → Decrease DEF (Warmaiden, Stag Knight) → Ninja A3 (AOE Freeze + damage) → Ninja A2 (if needed for cleanup). Works in Gold 3-5 Arena. NOTE: Passive stacking NOT reliable in Arena (fights too short). Build for burst damage, not passive scaling.",
    "FACTION WARS (Shadowkin): Lifesteal + Speed sets for survivability. 100% C.RATE, 220+ SPD, 250+ ACC, C.DMG 200%+, ATK 3,500+, HP 40,000+ (survivability). A3 Freeze for wave control, A2 HP Burn + activation for boss stages. Passive stacking enables solo carry potential for Shadowkin faction (Ninja can 1v5 bosses after max stacks). User Shadowkin faction progress unknown.",
    "NOTE: 100% C.RATE is NON-NEGOTIABLE for Ninja. Passive stacking scales ATK and C.DMG, so crit-based damage is CRITICAL. Lifesteal is recommended for all PVE content except Arena (enables sustainability for long fights). Savage + Cruel for Arena nuker build (ignore DEF + C.DMG). Relentless for advanced CB builds (extra turns for A2 spam). Perception/Accuracy sets for ACC breakpoints (250+ UNM CB, 350+ Hard DT)."
  ],
  "masteries": {
    "clan_boss": [
      "Offense: Deadly Precision, Keen Strike, Heart of Glory, Single Out, Bring it Down, Methodical, GIANT SLAYER (A2 'Hailburn' attacks 3 times = multi-hit, 30% proc per hit × 3 hits = ~66% total proc chance for 3% enemy MAX HP damage). Warmaster ALSO viable (A1 single-hit + some A2 hits = 60% proc for 4% enemy MAX HP damage). RECOMMENDATION: Giant Slayer for A2-focused builds (HP Burn spam), Warmaster for balanced A1/A2 usage. Both valid.",
      "Support: Pinpoint Accuracy, Charged Focus, SWARM SMITER (CRITICAL - A2 multi-hit synergy, extra damage per hit), Evil Eye (TM control with A1 Decrease DEF), Lore of Steel (gear stat boost), MASTER HEXER (CRITICAL - extends HP Burn debuffs from 3→4 turns = more damage + more A2 activation value), EAGLE EYE (CRITICAL +50 ACC for 250+ total, reliable Decrease DEF + HP Burn landing), Sniper (extra C.DMG for nuking)",
      "Defense: Tough Skin (reduce incoming damage), Blastproof (AOE damage reduction), Resurgent (heal on low HP), Delay Death (survive fatal blows), Retribution (team TM boost when hit)"
    ],
    "dungeons": [
      "Offense: Deadly Precision, Keen Strike, Heart of Glory, Single Out, Bring it Down, GIANT SLAYER (A2 multi-hit synergy). Warmaster also viable for A1 focus.",
      "Support: Charged Focus, SWARM SMITER (CRITICAL - A2 multi-hit synergy), Lore of Steel (gear boost), SNIPER (CRITICAL - extra C.DMG for nuking), Evil Eye (TM control), Master Hexer (HP Burn extension), Eagle Eye (ACC boost if needed)",
      "Defense: Tough Skin, Blastproof, Resurgent, Delay Death, Retribution"
    ],
    "arena": [
      "Offense: Deadly Precision, Keen Strike, Heart of Glory, Single Out, HELMSMASHER (ignore DEF for burst damage in Arena - better than Giant Slayer/Warmaster for short fights), Shield Breaker (counter shield comps)",
      "Support: Charged Focus, SWARM SMITER (A2 synergy), Lore of Steel (gear boost), SNIPER (CRITICAL - extra C.DMG for nuking), Cycle of Violence (speed boost after kill), Eagle Eye (ACC for Freeze if needed)",
      "Defense: Tough Skin, Blastproof, Resurgent, Delay Death, Retribution"
    ],
    "doom_tower": [
      "Offense: Deadly Precision, Keen Strike, Heart of Glory, Single Out, Bring it Down, GIANT SLAYER (A2 multi-hit synergy for boss damage).",
      "Support: Pinpoint Accuracy, Charged Focus, SWARM SMITER (CRITICAL - A2 multi-hit synergy), Evil Eye (TM control), EAGLE EYE (CRITICAL - +50 ACC for 350+ total for Hard DT), Lore of Steel (gear boost), Master Hexer (HP Burn extension), LASTING GIFTS (extends Perfect Veil buff from A2 for survivability)",
      "Defense: Tough Skin, Blastproof, Resurgent, Delay Death, Retribution"
    ],
    "faction_wars": [
      "Offense: Deadly Precision, Keen Strike, Heart of Glory, Single Out, Bring it Down, GIANT SLAYER (A2 multi-hit synergy).",
      "Support: Pinpoint Accuracy, Charged Focus, SWARM SMITER (CRITICAL - A2 multi-hit synergy), Evil Eye (TM control), EAGLE EYE (CRITICAL - +50 ACC for 250+ total), Lore of Steel (gear boost), Master Hexer (HP Burn extension), CYCLE OF MAGIC (reduces A2/A3 cooldowns for faster cycling)",
      "Defense: Tough Skin, Blastproof, Resurgent, Delay Death, Retribution"
    ],
    "general": [
      "PRIORITY OFFENSE T6: GIANT SLAYER for all PVE content (A2 'Hailburn' attacks 3 times = multi-hit, 30% proc per hit × 3 hits = ~66% total proc chance for 3% enemy MAX HP damage per proc). Warmaster ALSO viable for A1-focused builds (single-hit A1 = 60% proc for 4% enemy MAX HP damage). BOTH VALID - choose based on playstyle: Giant Slayer for A2 spam (HP Burn focus), Warmaster for balanced A1/A2 usage. Arena: HELMSMASHER for burst (ignore DEF better than GS/WM for short fights).",
      "PRIORITY SUPPORT T6: SWARM SMITER (CRITICAL - A2 multi-hit synergy, extra damage per hit), Master Hexer (extends HP Burn 3→4 turns = more A2 activation value), Eagle Eye (CRITICAL +50 ACC for 250+ UNM CB / 350+ Hard DT), Sniper (dungeons/Arena - extra C.DMG for nuking).",
      "PRIORITY DEFENSE T6: None critical, but Tough Skin + Delay Death recommended for survivability.",
      "KEY MASTERIES: Giant Slayer OR Warmaster (both viable, choose based on build), Swarm Smiter (CRITICAL A2 synergy), Master Hexer (HP Burn extension), Eagle Eye (ACC for debuff landing), Sniper (C.DMG for nuking), Helmsmasher (Arena burst).",
      "SYNERGIES: Passive 'Escalation' stacks when A1, A2, A3 ALL land on SAME target in ONE ROUND. VS BOSSES: +20% ATK, +10% C.DMG per stack (max 5 stacks = +100% ATK, +25% C.DMG total). A2 'Hailburn' instantly activates ALL HP Burn debuffs when used vs BOSSES (unique mechanic - only Ninja has this). Each HP Burn activation = 2.5% enemy MAX HP damage (ignores DEF). With A2 placing 3 HP Burns (100% chance when booked) + instant activation = 7.5% enemy MAX HP damage per A2 use (~ 3M on UNM CB). A3 vs bosses ignores 50% DEF + reduces A2 cooldown by 1 turn (enables A2 spam). Build for 100% C.RATE (non-negotiable), 220+ SPD, 250+ ACC (UNM CB) / 350+ ACC (Hard DT), C.DMG 200%+, ATK 3,500+. Lifesteal for sustainability. Passive stacking takes 5-7 turns to max out = front-loaded damage scaling.",
      "UNIQUE MECHANICS: Only champion in RAID with HP Burn ACTIVATION. A2 'Hailburn' instantly activates ALL HP Burn debuffs on ALL enemies (not just from Ninja - ANY source: Drexthar, Geomancer, Mortu-Macaab, Mordecai, Ultimate Galek, etc.). Each activation = 2.5% enemy MAX HP damage (ignores DEF). With multiple HP Burn sources, can instantly deal 10-15%+ enemy MAX HP damage per A2 use. CRITICAL for Spider (pair with AOE HP Burn champs), CB (HP Burn extension with Master Hexer), all boss content. A3 has DUAL MODE: vs waves = AOE Freeze (crowd control), vs bosses = single-target high damage (3.95 ATK, ignores 50% DEF) + reduces A2 CD by 1 turn. Passive stacking is ROUND-based (not turn-based) - requires A1, A2, A3 to ALL hit SAME target in ONE ROUND for stack. VS BOSSES: stacks FASTER (20% ATK, 10% C.DMG per stack vs 10% ATK, 2.5% C.DMG for waves).",
      "SHADOWKIN FACTION WARS: Ninja is top-tier for Shadowkin faction (10/10 rating). Passive stacking enables solo carry potential after max stacks (can 1v5 bosses). User Shadowkin faction progress unknown."
    ]
  },
  "blessings": [
    "Brimstone (All Content): +30% HP Burn damage. Ninja is HP Burn specialist - A2 places HP Burn + instantly activates. Brimstone boosts HP Burn tick damage from 2.5% enemy MAX HP to 3.25% enemy MAX HP (30% increase). BEST general-purpose blessing for Ninja. Synergizes with HP Burn activation mechanic.",
    "Phantom Touch (Clan Boss): Extends debuff duration by 1 turn on buff/debuff application (25% chance). Synergizes with HP Burn and Decrease DEF - extends 3→4 turns even without Master Hexer. BEST for CB UNM (more HP Burn uptime = more A2 activation value). Alternative to Brimstone for CB-focused builds.",
    "Cruelty (Dungeons/Doom Tower): +12% damage to debuffed enemies. Ninja applies HP Burn + Decrease DEF - always benefits. Good for general dungeon use when Brimstone is not available.",
    "NOTE: Brimstone is BEST general-purpose blessing (HP Burn damage boost). Phantom Touch is BEST for Clan Boss (debuff extension). Cruelty is general-purpose backup."
  ],
  "ai_quirks": {
    "bad_ai": false,
    "ai_issue_description": "Generally GOOD AI. Prioritizes bosses correctly. Uses A2 (Hailburn) and A3 (Cyan Slash) appropriately. NO MAJOR ISSUES. Perfect Veil from A2 prevents targeting, so AI can't misuse skills while protected. Minor issue: A3 uses AOE on waves (correct) but switches to single-target on boss (correct) - AI handles dual mode well."
  },
  "cheese_strategy": {
    "cheese_viable": true,
    "cheese_type": "HP Burn Activation (Boss Cheese)",
    "cheese_mechanic_info": "Ninja's A2 'Hailburn' HP Burn ACTIVATION is a UNIQUE mechanic in RAID Shadow Legends (only champion with this ability). When used against BOSSES, A2 instantly activates ALL HP Burn debuffs on ALL enemies, dealing 2.5% enemy MAX HP damage per HP Burn (ignores DEF). This bypasses DEF scaling and enables massive burst damage against any boss regardless of stats. With multiple HP Burn sources (Drexthar, Geomancer, Mortu-Macaab, Mordecai, Ultimate Galek, etc.), Ninja can instantly deal 10-15%+ enemy MAX HP damage per A2 use. This makes Ninja meta-defining for Spider, Clan Boss, and all boss content.",
    "specific_comps_and_synergies": [
      {
        "comp_name": "Clan Boss UNM (HP Burn Activation)",
        "champions": ["Ninja", "HP Burn champion (Geomancer recommended)", "Decrease DEF", "Increase ATK/C.DMG buffer", "Ally Protection/Unkillable"],
        "mechanics": "Ninja places 3 HP Burns with A2 (100% chance when booked) and instantly activates them for 7.5% CB MAX HP damage (~3M on UNM). Geomancer's passive places HP Burn via A3 + passive reflection. Master Hexer mastery extends HP Burns from 3→4 turns (50% more uptime). Typical rotation: Geomancer A3 (HP Burn on CB) → Ninja A2 (activate + place 3 more HP Burns + activate instantly) → repeat. Passive 'Escalation' stacks +20% ATK, +10% C.DMG per round (max 5 stacks = +100% ATK, +25% C.DMG by turn 5-7). Typical CB damage: 10-20M (early game), 20-40M (mid-game), 40-60M+ (end-game with max stacks).",
        "notes": "Ninja is S-tier for CB UNM (10/10 rating). MUST book A2 (100% HP Burn) and A3 (4-turn CD). Speed tune: 171-191 (Budget Unkillable), 220+ (Counterattack), specific speeds (Myth-Heir). Giant Slayer OR Warmaster (both viable). Relentless set advanced build (18% extra turn = double A2 activation for 50M+ damage)."
      },
      {
        "comp_name": "Spider 25 (AOE HP Burn + Activation)",
        "champions": ["Ninja", "AOE HP Burn (Drexthar, Ultimate Galek, Mordecai, Achak + Sicia)", "Decrease SPD", "Leech/Healer", "Reviver/Tank"],
        "mechanics": "AOE HP Burn champions place HP Burn on ALL spiderlings + mother spider. Ninja A2 instantly activates ALL HP Burn debuffs for massive AOE damage (2.5% MAX HP × 10-20 enemies = 25-50% total enemy team MAX HP damage per A2 use). A3 Freeze prevents spiderling counterattacks. Typical clear time: 1:00-2:00 (with good HP Burn team). Ninja often top damage dealer (40-60% of team damage).",
        "notes": "Ninja is top-tier for Spider 25 (10/10 rating). Pair with AOE HP Burn champs for maximum A2 value. Perfect Veil from A2 protects Ninja from spiderling targeting. A3 Freeze for crowd control."
      },
      {
        "comp_name": "Doom Tower - Celestial Griffin (HP Burn Spam)",
        "champions": ["Ninja", "HP Burn champion", "Decrease DEF", "Healer/Reviver", "Shielder"],
        "mechanics": "Celestial Griffin boss has high HP pool. Ninja A2 HP Burn activation deals 2.5% boss MAX HP per burn (ignores DEF). With A3 reducing A2 cooldown by 1 turn, can spam A2 every 2-3 turns for consistent MAX HP damage. Passive stacking reaches +100% ATK, +25% C.DMG by turn 5-7 = massive damage scaling. Top DT leaderboard teams use Ninja for Celestial Griffin (speed clear < 2 minutes).",
        "notes": "Ninja is meta for Celestial Griffin (top global leaderboard teams). Build for 350+ ACC (Hard DT), 220+ SPD, 100% C.RATE, C.DMG 200%+."
      },
      {
        "comp_name": "Doom Tower - Bommal Dreadhorn (Freeze Dreadbombs)",
        "champions": ["Ninja", "AOE HP Burn", "Decrease SPD", "Healer/Reviver", "Shielder"],
        "mechanics": "Bommal spawns Dreadbombs (minions) that counterattack when hit, dealing massive damage (can one-shot champions). Ninja A3 Freeze prevents Dreadbombs from counterattacking, reducing damage by 50%+ (frozen enemies cannot counterattack). A2 HP Burn activation for boss damage. Passive stacking for damage scaling.",
        "notes": "Ninja is excellent for Bommal (8/10 rating). A3 Freeze is CRITICAL for surviving Dreadbomb counterattacks. 100% Freeze chance (booked A3) required."
      },
      {
        "comp_name": "Doom Tower - Nether Spider (Freeze Spiderlings)",
        "champions": ["Ninja", "Shielder (Brogni, etc.)", "Leech champion", "Reviver", "Debuffer"],
        "mechanics": "Nether Spider has spiderlings that counterattack when hit with AOE. Ninja A3 Freeze prevents spiderlings from counterattacking (frozen enemies cannot act). A2 HP Burn activation for mother spider damage. Perfect Veil from A2 protects Ninja from targeting.",
        "notes": "Ninja is solid for Nether Spider (7/10 rating). A3 Freeze prevents spiderling counterattacks + healing. Build for 350+ ACC (Hard DT)."
      },
      {
        "comp_name": "Doom Tower - Scarab King, Dark Fae, Eternal Dragon (HP Burn Bypass)",
        "champions": ["Ninja", "HP Burn champion", "Shield spammer", "Leech/Healer", "Reviver"],
        "mechanics": "All three bosses have high HP pools + defensive mechanics. Ninja A2 HP Burn activation bypasses DEF scaling (2.5% MAX HP per burn ignores DEF). Scarab King: HP Burn ticks through permanent shield. Dark Fae: HP Burn activation before she reaches 5 dark energy. Eternal Dragon: Top global leaderboard teams use Ninja (HP Burn activation spam).",
        "notes": "Ninja is meta for multiple DT Hard bosses. Build for 350+ ACC, 220+ SPD, 100% C.RATE, C.DMG 200%+, HP 50,000+ (survivability)."
      }
    ],
    "requirements": "A2 fully booked (100% HP Burn chance), A3 booked (4-turn CD + 100% Freeze chance), 100% C.RATE (non-negotiable), 220+ SPD (speed tune dependent), 250+ ACC (UNM CB) / 350+ ACC (Hard DT), C.DMG 200%+, ATK 3,500+ (pre-passive stacking), Lifesteal sets for sustainability (PVE), Savage + Cruel for Arena nuker builds, Giant Slayer OR Warmaster masteries (both viable), Swarm Smiter + Master Hexer + Eagle Eye support masteries (CRITICAL)",
    "strengths": "Only champion in RAID with HP Burn ACTIVATION (unique mechanic). Top-tier for ALL boss content (10/10 CB, 10/10 Dungeons, 9/10 DT, 10/10 FW). Passive stacking scales ATK and C.DMG for massive damage (reaches +100% ATK, +25% C.DMG by turn 5-7). A3 Freeze for crowd control (100% chance when booked). Perfect Veil from A2 for survivability. Dual mode A3 (AOE vs waves, single-target vs bosses). A1 Decrease DEF for team damage boost. Free champion (login event) = accessible to all players. Works in F2P/budget comps. Shadowkin faction carry potential (solo 1v5 bosses after max stacks).",
    "weaknesses": "Requires FULL BOOKING (13 tomes for A2 + A3). 100% C.RATE non-negotiable (passive stacking scales crit damage). Passive stacking is ROUND-based (requires A1, A2, A3 to ALL hit SAME target in ONE ROUND) - unreliable in Arena (fights too short). Random targeting on A2 (can miss priority targets in waves). Perfect Veil from A2 only lasts 2 turns (must cycle A2 for uptime). Low base HP/DEF (16,845 HP, 947 DEF) = squishy without Lifesteal/shields. Requires high ACC (250-350+ depending on content). A1 TM boost vs bosses can break speed tunes if not accounted for. HP Burn activation ONLY works vs BOSSES (not useful in Arena). Relentless build high-risk (can break CB speed tunes). Shadowkin faction (new faction, limited champion pool for FW synergy)."
  },
  "mechanics_advisory": "Ninja's A2 'Hailburn' HP Burn ACTIVATION is the ONLY mechanic of its kind in RAID Shadow Legends. When used against BOSSES, A2 instantly activates ALL HP Burn debuffs on ALL enemies (not just from Ninja - ANY source). Each HP Burn activation deals 2.5% enemy MAX HP damage and ignores 100% DEF. This makes Ninja meta-defining for all boss content (Clan Boss, Spider, Doom Tower bosses, etc.) because MAX HP damage bypasses DEF scaling. Example: UNM Clan Boss has 150M HP. With 3 HP Burns active (from Ninja A2), instant activation = 7.5% of 150M = 11.25M damage per A2 use (ignores DEF). With Master Hexer mastery extending HP Burns from 3→4 turns, and A3 reducing A2 cooldown by 1 turn, Ninja can spam A2 every 2-3 turns for consistent MAX HP damage. Passive 'Escalation' stacks +20% ATK, +10% C.DMG per ROUND when A1, A2, A3 ALL hit SAME target (max 5 stacks = +100% ATK, +25% C.DMG). Typical CB fight: reaches max stacks by turn 5-7 = front-loaded damage scaling. Build for 100% C.RATE (non-negotiable - passive scales crit damage), 220+ SPD (speed tune dependent), 250+ ACC (UNM CB) / 350+ ACC (Hard DT), C.DMG 200%+, ATK 3,500+ (pre-passive). Lifesteal for sustainability (PVE). Giant Slayer OR Warmaster (both viable - GS for A2 focus, WM for A1/A2 balanced). Swarm Smiter + Master Hexer + Eagle Eye support masteries are CRITICAL. MUST fully book A2 (100% HP Burn) and A3 (4-turn CD + 100% Freeze). Typical CB damage: 10-20M (early game), 20-40M (mid-game), 40-60M+ (end-game). For Doom Tower Hard, 350+ ACC required. For Arena, build for burst (Savage + Cruel sets, 250+ SPD, C.DMG 250%+) - ignore passive stacking (fights too short). Ninja works in F2P/budget comps (free champion from login event). Top-tier for Shadowkin Faction Wars (10/10 rating) - solo carry potential after max stacks. User Shadowkin faction progress unknown.",
  "validation_metadata": {
    "stat_confidence": 100,
    "data_sources": "existing_complete_file+ayumilove_verification",
    "ocr_notes": "Stats from Complete/ directory file (existing data), verified against Ayumilove. Base stats confirmed: HP 16,845, ATK 1,509, DEF 947, SPD 100, C.RATE 15, C.DMG 63, RES 30, ACC 10. AFFINITY CORRECTED: Complete/ file showed 'Spirit' but Ayumilove confirms 'Magic' - corrected to Magic. No aura. 100% confidence."
  },
  "citations": [
    "Ayumilove: https://ayumilove.net/raid-shadow-legends-ninja-skill-mastery-equip-guide/ (accessed 2025-10-26)",
    "HellHades: https://hellhades.com/champions/ninja/ (accessed 2025-10-22)",
    "Existing Complete/ directory file (2025-10-22) - affinity corrected from Spirit to Magic",
    "Community consensus: S-tier Legendary for CB/Dungeons/Doom Tower (Ayumilove S-rank, HellHades S-rank, Reddit community S-tier)",
    "Patch 4.40 Notes (2021-07-01): Ninja introduced as limited-time free champion (login event, Twitch streamer collaboration)"
  ],
  "author": "GitHub Copilot (Batch 2 comprehensive population - 2025-10-26)",
  "update_notes": [
    "2025-10-26: Restructured from Complete/ directory file to match canonical Champion_Dictionary_Template.json. Moved from 'forms' array structure to flat base_stats. CORRECTED AFFINITY from 'Spirit' to 'Magic' (Ayumilove verification). Expanded recommended_gear from gear name list to content-specific detailed string array (7 entries). Expanded blessings from name list to detailed recommendations (4 entries). Expanded cheese_strategy to comprehensive documentation (6 specific comps with mechanics, notes, requirements, strengths, weaknesses). Added extensive mechanics_advisory (HP Burn activation mechanics, passive stacking, damage benchmarks, build priorities). Populated all skill effects arrays (A1 3 effects, A2 4 effects, A3 4 effects, Passive 4 effects - total 15 effect objects). Added validation_metadata (100% confidence, affinity correction documented). Added author field. Fixed aura placement (moved to root from forms array, confirmed 'None' aura). Changed draft from undefined to false. Template-compliant with all Pain Keeper/Skullcrusher/Frozen Banshee/Geomancer standards.",
    "2025-10-22 (original Complete/ file): Initial comprehensive entry with masteries, skills, ratings. Patch 4.40 notes added. AFFINITY ERROR: Listed as 'Spirit' but should be 'Magic' (corrected 2025-10-26)."
  ],
  "draft": false
}
